tutorials/coodles/pitzDaily/constant/polyMesh/boundary
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "coodles";
    case "pitzDaily";
    instance ""constant"";
    local "polyMesh";

    class polyBoundaryMesh;
    object boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
inlet
{
    type patch;
    physicalType turbulentInlet;
    nFaces 30;
    startFace 24170;
}

outlet
{
    type patch;
    physicalType pressureTransmissiveOutlet;
    nFaces 57;
    startFace 24200;
}

upperWall
{
    type wall;
    physicalType fixedTemperatureWall;
    nFaces 223;
    startFace 24257;
}

lowerWall
{
    type wall;
    physicalType fixedTemperatureWall;
    nFaces 250;
    startFace 24480;
}

frontAndBack
{
    type empty;
    physicalType empty;
    nFaces 24450;
    startFace 24730;
}
)

// ************************************************************************* //
